; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f4-c8-s4-i8-010-110-210-310
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10
 - card
          celln0 celln1 celln2 celln3 celln4 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln4)
(colspace coln0)

(bottomcol s9)
(on d1 s9)
(clear d1)

(bottomcol c3)
(on d3 c3)
(on s2 d3)
(on h6 s2)
(on c6 h6)
(on s10 c6)
(on h8 s10)
(on s1 h8)
(on h7 s1)
(on s4 h7)
(on h2 s4)
(clear h2)

(bottomcol c8)
(on d5 c8)
(on s7 d5)
(on s3 s7)
(clear s3)

(bottomcol c7)
(on c5 c7)
(on d10 c5)
(clear d10)

(bottomcol c10)
(on c1 c10)
(on d7 c1)
(on h9 d7)
(clear h9)

(bottomcol c4)
(on d4 c4)
(on c9 d4)
(on h3 c9)
(on d6 h3)
(clear d6)

(bottomcol c2)
(on d8 c2)
(on d9 d8)
(clear d9)

(bottomcol h4)
(on d2 h4)
(on s6 d2)
(on s5 s6)
(on h1 s5)
(on h10 h1)
(on s8 h10)
(on h5 s8)
(clear h5)
)
(:goal
(and
(home c10)
(home h10)
(home s10)
(home d10)
)
)
)

; plan
1. (sendtohome d1 s9 d n1 d0 n0)
   deleted: (on d1 s9) (home d0) (clear d1)
   added: (home d1) (clear s9)
   goals met: 0 of 4
2. (sendtofree s3 s7 celln4 celln3)
   deleted: (on s3 s7) (clear s3) (cellspace celln4)
   added: (incell s3) (clear s7) (cellspace celln3)
   goals met: 0 of 4
3. (sendtofree h2 s4 celln3 celln2)
   deleted: (on h2 s4) (clear h2) (cellspace celln3)
   added: (incell h2) (clear s4) (cellspace celln2)
   goals met: 0 of 4
4. (sendtofree h5 s8 celln2 celln1)
   deleted: (on h5 s8) (clear h5) (cellspace celln2)
   added: (incell h5) (clear s8) (cellspace celln1)
   goals met: 0 of 4
5. (sendtofree s4 h7 celln1 celln0)
   deleted: (on s4 h7) (clear s4) (cellspace celln1)
   added: (incell s4) (clear h7) (cellspace celln0)
   goals met: 0 of 4
6. (move h7 s1 s8)
   deleted: (on h7 s1) (clear s8)
   added: (on h7 s8) (clear s1)
   goals met: 0 of 4
7. (sendtohome s1 h8 s n1 s0 n0)
   deleted: (on s1 h8) (home s0) (clear s1)
   added: (home s1) (clear h8)
   goals met: 0 of 4
8. (move h8 s10 s9)
   deleted: (on h8 s10) (clear s9)
   added: (on h8 s9) (clear s10)
   goals met: 0 of 4
9. (move s7 d5 h8)
   deleted: (on s7 d5) (clear h8)
   added: (on s7 h8) (clear d5)
   goals met: 0 of 4
10. (move d6 h3 s7)
   deleted: (on d6 h3) (clear s7)
   added: (on d6 s7) (clear h3)
   goals met: 0 of 4
11. (colfromfreecell s4 d5 celln0 celln1)
   deleted: (incell s4) (cellspace celln0) (clear d5)
   added: (cellspace celln1) (clear s4) (on s4 d5)
   goals met: 0 of 4
12. (move h3 c9 s4)
   deleted: (on h3 c9) (clear s4)
   added: (on h3 s4) (clear c9)
   goals met: 0 of 4
13. (sendtofree d10 c5 celln1 celln0)
   deleted: (on d10 c5) (clear d10) (cellspace celln1)
   added: (incell d10) (clear c5) (cellspace celln0)
   goals met: 0 of 4
14. (move c5 c7 d6)
   deleted: (on c5 c7) (clear d6)
   added: (on c5 d6) (clear c7)
   goals met: 0 of 4
15. (move d9 d8 s10)
   deleted: (on d9 d8) (clear s10)
   added: (on d9 s10) (clear d8)
   goals met: 0 of 4
16. (move d8 c2 c9)
   deleted: (on d8 c2) (clear c9)
   added: (on d8 c9) (clear c2)
   goals met: 0 of 4
17. (move-b c7 d8 coln0 coln1)
   deleted: (bottomcol c7) (clear d8) (colspace coln0)
   added: (on c7 d8) (colspace coln1)
   goals met: 0 of 4
18. (sendtonewcol h9 d7 coln1 coln0)
   deleted: (on h9 d7) (colspace coln1)
   added: (bottomcol h9) (clear d7) (colspace coln0)
   goals met: 0 of 4
19. (move-b c2 h3 coln0 coln1)
   deleted: (bottomcol c2) (clear h3) (colspace coln0)
   added: (on c2 h3) (colspace coln1)
   goals met: 0 of 4
20. (sendtonewcol d7 c1 coln1 coln0)
   deleted: (on d7 c1) (colspace coln1)
   added: (bottomcol d7) (clear c1) (colspace coln0)
   goals met: 0 of 4
21. (sendtohome c1 c10 c n1 c0 n0)
   deleted: (on c1 c10) (home c0) (clear c1)
   added: (home c1) (clear c10)
   goals met: 0 of 4
22. (sendtohome c2 h3 c n2 c1 n1)
   deleted: (on c2 h3) (home c1) (clear c2)
   added: (home c2) (clear h3)
   goals met: 0 of 4
23. (move-b h9 c10 coln0 coln1)
   deleted: (bottomcol h9) (clear c10) (colspace coln0)
   added: (on h9 c10) (colspace coln1)
   goals met: 0 of 4
24. (sendtonewcol h7 s8 coln1 coln0)
   deleted: (on h7 s8) (colspace coln1)
   added: (bottomcol h7) (clear s8) (colspace coln0)
   goals met: 0 of 4
25. (move s8 h10 d9)
   deleted: (on s8 h10) (clear d9)
   added: (on s8 d9) (clear h10)
   goals met: 0 of 4
26. (move-b h7 s8 coln0 coln1)
   deleted: (bottomcol h7) (clear s8) (colspace coln0)
   added: (on h7 s8) (colspace coln1)
   goals met: 0 of 4
27. (sendtonewcol h10 h1 coln1 coln0)
   deleted: (on h10 h1) (colspace coln1)
   added: (bottomcol h10) (clear h1) (colspace coln0)
   goals met: 0 of 4
28. (sendtohome h1 s5 h n1 h0 n0)
   deleted: (on h1 s5) (home h0) (clear h1)
   added: (home h1) (clear s5)
   goals met: 0 of 4
29. (homefromfreecell h2 h n2 h1 n1 celln0 celln1)
   deleted: (incell h2) (cellspace celln0) (home h1)
   added: (home h2) (cellspace celln1)
   goals met: 0 of 4
30. (sendtohome h3 s4 h n3 h2 n2)
   deleted: (on h3 s4) (home h2) (clear h3)
   added: (home h3) (clear s4)
   goals met: 0 of 4
31. (sendtofree s5 s6 celln1 celln0)
   deleted: (on s5 s6) (clear s5) (cellspace celln1)
   added: (incell s5) (clear s6) (cellspace celln0)
   goals met: 0 of 4
32. (move s6 d2 d7)
   deleted: (on s6 d2) (clear d7)
   added: (on s6 d7) (clear d2)
   goals met: 0 of 4
33. (sendtohome d2 h4 d n2 d1 n1)
   deleted: (on d2 h4) (home d1) (clear d2)
   added: (home d2) (clear h4)
   goals met: 0 of 4
34. (sendtohome-b h4 h n4 h3 n3 coln0 coln1)
   deleted: (home h3) (clear h4) (bottomcol h4) (colspace coln0)
   added: (home h4) (colspace coln1)
   goals met: 0 of 4
35. (homefromfreecell h5 h n5 h4 n4 celln0 celln1)
   deleted: (incell h5) (cellspace celln0) (home h4)
   added: (home h5) (cellspace celln1)
   goals met: 0 of 4
36. (sendtofree s4 d5 celln1 celln0)
   deleted: (on s4 d5) (clear s4) (cellspace celln1)
   added: (incell s4) (clear d5) (cellspace celln0)
   goals met: 0 of 4
37. (sendtonewcol h9 c10 coln1 coln0)
   deleted: (on h9 c10) (colspace coln1)
   added: (bottomcol h9) (clear c10) (colspace coln0)
   goals met: 0 of 4
38. (move d5 c8 s6)
   deleted: (on d5 c8) (clear s6)
   added: (on d5 s6) (clear c8)
   goals met: 0 of 4
39. (move h7 s8 c8)
   deleted: (on h7 s8) (clear c8)
   added: (on h7 c8) (clear s8)
   goals met: 0 of 4
40. (move s8 d9 h9)
   deleted: (on s8 d9) (clear h9)
   added: (on s8 h9) (clear d9)
   goals met: 0 of 4
41. (move d9 s10 c10)
   deleted: (on d9 s10) (clear c10)
   added: (on d9 c10) (clear s10)
   goals met: 0 of 4
42. (move h7 c8 s8)
   deleted: (on h7 c8) (clear s8)
   added: (on h7 s8) (clear c8)
   goals met: 0 of 4
43. (move-b c8 d9 coln0 coln1)
   deleted: (bottomcol c8) (clear d9) (colspace coln0)
   added: (on c8 d9) (colspace coln1)
   goals met: 0 of 4
44. (sendtonewcol s10 c6 coln1 coln0)
   deleted: (on s10 c6) (colspace coln1)
   added: (bottomcol s10) (clear c6) (colspace coln0)
   goals met: 0 of 4
45. (move c6 h6 h7)
   deleted: (on c6 h6) (clear h7)
   added: (on c6 h7) (clear h6)
   goals met: 0 of 4
46. (sendtohome h6 s2 h n6 h5 n5)
   deleted: (on h6 s2) (home h5) (clear h6)
   added: (home h6) (clear s2)
   goals met: 0 of 4
47. (sendtohome s2 d3 s n2 s1 n1)
   deleted: (on s2 d3) (home s1) (clear s2)
   added: (home s2) (clear d3)
   goals met: 0 of 4
48. (homefromfreecell s3 s n3 s2 n2 celln0 celln1)
   deleted: (incell s3) (cellspace celln0) (home s2)
   added: (home s3) (cellspace celln1)
   goals met: 0 of 4
49. (sendtohome d3 c3 d n3 d2 n2)
   deleted: (on d3 c3) (home d2) (clear d3)
   added: (home d3) (clear c3)
   goals met: 0 of 4
50. (sendtohome-b c3 c n3 c2 n2 coln0 coln1)
   deleted: (home c2) (clear c3) (bottomcol c3) (colspace coln0)
   added: (home c3) (colspace coln1)
   goals met: 0 of 4
51. (homefromfreecell s4 s n4 s3 n3 celln1 celln2)
   deleted: (incell s4) (cellspace celln1) (home s3)
   added: (home s4) (cellspace celln2)
   goals met: 0 of 4
52. (homefromfreecell s5 s n5 s4 n4 celln2 celln3)
   deleted: (incell s5) (cellspace celln2) (home s4)
   added: (home s5) (cellspace celln3)
   goals met: 0 of 4
53. (sendtofree c5 d6 celln3 celln2)
   deleted: (on c5 d6) (clear c5) (cellspace celln3)
   added: (incell c5) (clear d6) (cellspace celln2)
   goals met: 0 of 4
54. (sendtofree c7 d8 celln2 celln1)
   deleted: (on c7 d8) (clear c7) (cellspace celln2)
   added: (incell c7) (clear d8) (cellspace celln1)
   goals met: 0 of 4
55. (sendtofree d6 s7 celln1 celln0)
   deleted: (on d6 s7) (clear d6) (cellspace celln1)
   added: (incell d6) (clear s7) (cellspace celln0)
   goals met: 0 of 4
56. (sendtonewcol d8 c9 coln1 coln0)
   deleted: (on d8 c9) (colspace coln1)
   added: (bottomcol d8) (clear c9) (colspace coln0)
   goals met: 0 of 4
57. (move c9 d4 h10)
   deleted: (on c9 d4) (clear h10)
   added: (on c9 h10) (clear d4)
   goals met: 0 of 4
58. (sendtohome d4 c4 d n4 d3 n3)
   deleted: (on d4 c4) (home d3) (clear d4)
   added: (home d4) (clear c4)
   goals met: 0 of 4
59. (sendtohome-b c4 c n4 c3 n3 coln0 coln1)
   deleted: (home c3) (clear c4) (bottomcol c4) (colspace coln0)
   added: (home c4) (colspace coln1)
   goals met: 0 of 4
60. (homefromfreecell c5 c n5 c4 n4 celln0 celln1)
   deleted: (incell c5) (cellspace celln0) (home c4)
   added: (home c5) (cellspace celln1)
   goals met: 0 of 4
61. (sendtohome d5 s6 d n5 d4 n4)
   deleted: (on d5 s6) (home d4) (clear d5)
   added: (home d5) (clear s6)
   goals met: 0 of 4
62. (sendtohome s6 d7 s n6 s5 n5)
   deleted: (on s6 d7) (home s5) (clear s6)
   added: (home s6) (clear d7)
   goals met: 0 of 4
63. (sendtohome s7 h8 s n7 s6 n6)
   deleted: (on s7 h8) (home s6) (clear s7)
   added: (home s7) (clear h8)
   goals met: 0 of 4
64. (homefromfreecell d6 d n6 d5 n5 celln1 celln2)
   deleted: (incell d6) (cellspace celln1) (home d5)
   added: (home d6) (cellspace celln2)
   goals met: 0 of 4
65. (sendtohome-b d7 d n7 d6 n6 coln1 coln2)
   deleted: (home d6) (clear d7) (bottomcol d7) (colspace coln1)
   added: (home d7) (colspace coln2)
   goals met: 0 of 4
66. (sendtohome c6 h7 c n6 c5 n5)
   deleted: (on c6 h7) (home c5) (clear c6)
   added: (home c6) (clear h7)
   goals met: 0 of 4
67. (sendtohome h7 s8 h n7 h6 n6)
   deleted: (on h7 s8) (home h6) (clear h7)
   added: (home h7) (clear s8)
   goals met: 0 of 4
68. (homefromfreecell c7 c n7 c6 n6 celln2 celln3)
   deleted: (incell c7) (cellspace celln2) (home c6)
   added: (home c7) (cellspace celln3)
   goals met: 0 of 4
69. (sendtohome c8 d9 c n8 c7 n7)
   deleted: (on c8 d9) (home c7) (clear c8)
   added: (home c8) (clear d9)
   goals met: 0 of 4
70. (sendtohome s8 h9 s n8 s7 n7)
   deleted: (on s8 h9) (home s7) (clear s8)
   added: (home s8) (clear h9)
   goals met: 0 of 4
71. (sendtohome-b d8 d n8 d7 n7 coln2 coln3)
   deleted: (home d7) (clear d8) (bottomcol d8) (colspace coln2)
   added: (home d8) (colspace coln3)
   goals met: 0 of 4
72. (sendtohome c9 h10 c n9 c8 n8)
   deleted: (on c9 h10) (home c8) (clear c9)
   added: (home c9) (clear h10)
   goals met: 0 of 4
73. (sendtohome h8 s9 h n8 h7 n7)
   deleted: (on h8 s9) (home h7) (clear h8)
   added: (home h8) (clear s9)
   goals met: 0 of 4
74. (sendtohome-b s9 s n9 s8 n8 coln3 coln4)
   deleted: (home s8) (clear s9) (bottomcol s9) (colspace coln3)
   added: (home s9) (colspace coln4)
   goals met: 0 of 4
75. (sendtohome-b s10 s n10 s9 n9 coln4 coln5)
   deleted: (home s9) (clear s10) (bottomcol s10) (colspace coln4)
   added: (home s10) (colspace coln5)
   goals met: 1 of 4
76. (sendtohome-b h9 h n9 h8 n8 coln5 coln6)
   deleted: (home h8) (clear h9) (bottomcol h9) (colspace coln5)
   added: (home h9) (colspace coln6)
   goals met: 1 of 4
77. (sendtohome-b h10 h n10 h9 n9 coln6 coln7)
   deleted: (home h9) (clear h10) (bottomcol h10) (colspace coln6)
   added: (home h10) (colspace coln7)
   goals met: 2 of 4
78. (sendtohome d9 c10 d n9 d8 n8)
   deleted: (on d9 c10) (home d8) (clear d9)
   added: (home d9) (clear c10)
   goals met: 2 of 4
79. (sendtohome-b c10 c n10 c9 n9 coln7 coln8)
   deleted: (home c9) (clear c10) (bottomcol c10) (colspace coln7)
   added: (home c10) (colspace coln8)
   goals met: 3 of 4
80. (homefromfreecell d10 d n10 d9 n9 celln3 celln4)
   deleted: (incell d10) (cellspace celln3) (home d9)
   added: (home d10) (cellspace celln4)
   goals met: 4 of 4
